DataProcessors/ЗагрузкаИзБанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаИзБанка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаОпераций</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбранныйПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбранныйБанк</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ЗагрузкаИзБанка/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыбратьФайл(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файлы Excel (*.xlsx)|*.xlsx";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект);
	Диалог.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбора(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы <> Неопределено Тогда
		// Добавляем ЭтотОбъект.
		Объект.ВыбранныйПутьКФайлу = ВыбранныеФайлы[0]; 
		Объект.ИмяФайла = ВыбранныеФайлы[0];
		Сообщить("Файл выбран. Путь: " + Объект.ВыбранныйПутьКФайлу);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	// Добавляем ЭтотОбъект.
	Если ПустаяСтрока(Объект.ВыбранныйПутьКФайлу) Тогда
		Сообщить("Сначала выберите файл!");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНаСервере(Объект.ВыбранныйПутьКФайлу);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(Знач Путь)
	Если Объект.ВыбранныйБанк = Перечисления.Банки.СберБанк Тогда
	ТабДок = Новый ТабличныйДокумент;
	Попытка
		ТабДок.Прочитать(Путь);
	Исключение
		Сообщить("Ошибка чтения файла!"); Возврат;
	КонецПопытки;
	
	Объект.ТаблицаОпераций.Очистить();
	
	Для НомерСтроки = 2 По ТабДок.ВысотаТаблицы Цикл
		ТекстДаты = ТабДок.Область(НомерСтроки, 2).Текст; // "01 апр. 20"
		Если ПустаяСтрока(ТекстДаты) Тогда Продолжить; КонецЕсли;
		
		НоваяСтрока = Объект.ТаблицаОпераций.Добавить();
		
		// Используем функцию для конвертации строки в реальную Дату
		НоваяСтрока.Дата = ПреобразоватьДатуИзСбера(ТекстДаты);
		
		НоваяСтрока.КатегорияБанка = ТабДок.Область(НомерСтроки, 4).Текст;
		НоваяСтрока.Описание = ТабДок.Область(НомерСтроки, 8).Текст;
		СтрСумма = СтрЗаменить(СтрЗаменить(ТабДок.Область(НомерСтроки, 5).Текст, " ", ""), ",", ".");
		Попытка
			НоваяСтрока.Сумма = Число(СтрСумма);
		Исключение
			НоваяСтрока.Сумма = 0;
		КонецПопытки;
		
		НоваяСтрока.Статус = "Загружено";
	КонецЦикла;
ИначеЕсли Объект.ВыбранныйБанк = Перечисления.Банки.ТБанк Тогда
	 ТабДок = Новый ТабличныйДокумент;
	Попытка
		ТабДок.Прочитать(Путь);
	Исключение
		Сообщить("Ошибка чтения файла!"); Возврат;
	КонецПопытки;
	
	Объект.ТаблицаОпераций.Очистить();
	
	Для НомерСтроки = 2 По ТабДок.ВысотаТаблицы Цикл
		ТекстДаты = ТабДок.Область(НомерСтроки, 2).Текст; // "01 апр. 20"
		Если ПустаяСтрока(ТекстДаты) Тогда Продолжить; КонецЕсли;
				НоваяСтрока = Объект.ТаблицаОпераций.Добавить();
		
		// Используем функцию для конвертации строки в реальную Дату
		НоваяСтрока.Дата = ПреобразоватьДатуИзСбера(ТекстДаты);
		
		НоваяСтрока.КатегорияБанка = ТабДок.Область(НомерСтроки, 10).Текст;
		НоваяСтрока.Описание = ТабДок.Область(НомерСтроки, 12).Текст;
		СтрСумма = СтрЗаменить(СтрЗаменить(ТабДок.Область(НомерСтроки, 5).Текст, " ", ""), ",", ".");
		Попытка
			НоваяСтрока.Сумма = ?(Число(СтрСумма) < 0, -Число(СтрСумма), Число(СтрСумма));
		Исключение
    		НоваяСтрока.Сумма = 0;
		КонецПопытки;		
		НоваяСтрока.Статус = "Загружено";
	КонецЦикла;

	КонецЕсли;
КонецПроцедуры

// Функция-помощник для парсинга даты
&НаСервере
Функция ПреобразоватьДатуИзСбера(Знач СтрДаты)
	
	// Ожидаем строку типа "01 апр. 2026"
	СтрДаты = СокрЛП(НРег(СтрДаты)); 
	
	// 1. Получаем День (первые 2 символа)
	День = Число(Лев(СтрДаты, 2));
	
	// 2. Определяем Месяц (ищем подстроку в списке сокращений)
	СписокМесяцев = "янв,фев,мар,апр,май,июн,июл,авг,сен,окт,ноя,дек";
	МассивМесяцев = СтрРазделить(СписокМесяцев, ",");
	
	НомерМесяца = 1;
	Для н = 0 По 11 Цикл
		Если Найти(СтрДаты, МассивМесяцев[н]) > 0 Тогда
			НомерМесяца = н + 1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// 3. Получаем Год (последние цифры после последнего пробела или просто последние 4)
	// Берем последние 4 символа для полной даты
	СтрГод = Прав(СтрДаты, 4);
	Попытка
		Год = Число(СтрГод);
		// Если в строке было "20", а не "2020", добавим век
		Если Год < 100 Тогда 
			Год = 2000 + Год;
		КонецЕсли;
	Исключение
		Год = Год(ТекущаяДата());
	КонецПопытки;
	
	Попытка
		Возврат Дата(Год, НомерМесяца, День);
	Исключение
		Возврат ТекущаяДата(); 
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура СоздатьДокументыНаСервере()
	                             
						    
	// Поиск валюты один раз перед циклом
	ВалютаРубль = Справочники.Валюты.НайтиПоНаименованию("руб");
	Если ВалютаРубль.Пустая() Тогда
		ВалютаРубль = Справочники.Валюты.НайтиПоНаименованию("RUB");
		КонецЕсли;
	Если ВалютаРубль.Пустая()  Тогда
		ВалютаРубль = Справочники.Валюты.НайтиПоНаименованию("Российский рубль");
		КонецЕсли;

	СчетчикСозданных = 0;

	Для Каждого СтрокаТЧ Из Объект.ТаблицаОпераций Цикл
		
		// Проверяем галочку в колонке "Выбрано"
		Если СтрокаТЧ.Выбрано = Истина Тогда 
			НовыйДокумент = Документы.Расход.СоздатьДокумент(); 
			НовыйДокумент.ОбменДанными.Загрузка = Истина;
			НовыйДокумент.Дата             = СтрокаТЧ.Дата; // Берем дату из Excel
			НовыйДокумент.Пользователь      = Объект.Пользователь;
			НовыйДокумент.Валюта           = ВалютаРубль;
			НовыйДокумент.Категория = СтрокаТЧ.Категория1С; 
			НовыйДокумент.Сумма             = СтрокаТЧ.Сумма;
			НовыйДокумент.Курс             = 1;
			Попытка
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
				СтрокаТЧ.Статус = "Документ создан";
				СчетчикСозданных = СчетчикСозданных + 1;
			Исключение
				СтрокаТЧ.Статус = "Ошибка проведения!";
				Сообщить("Ошибка при создании документа от " + СтрокаТЧ.Дата + ": " + ОписаниеОшибки());
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СчетчикСозданных > 0 Тогда
		Сообщить("Успешно создано документов: " + СчетчикСозданных);
	Иначе
		Сообщить("Не выбрано ни одной строки для создания документов.");
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура СоздатьДокумент(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Пользователь) Тогда
		Сообщить("Укажите пользователя!");
		Возврат;
	КонецЕсли;
	СоздатьДокументыНаСервере();
КонецПроцедуры
